Case Data/Convection/cd_upwind/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;               
}

gradSchemes
{
    default         Gauss linear;        
}

divSchemes
{
    default         none;                
    div(phi,T)      Gauss upwind grad(T);        
}

laplacianSchemes
{
    default         none;
    laplacian(DT,T) Gauss linear corrected;  
}

interpolationSchemes
{
    default         linear;            
}

snGradSchemes
{
    default         corrected;           
}

// ************************************************************************* //
